#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PHLAT-SERVICE.keycloak_openid_hardcoded_claim_protocol_mapper.orgId will be created
  + resource "keycloak_openid_hardcoded_claim_protocol_mapper" "orgId" {
      + add_to_access_token = true
      + add_to_id_token     = true
      + add_to_userinfo     = true
      + claim_name          = "orgId"
      + claim_value         = "00002855"
      + claim_value_type    = "String"
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "orgId"
      + realm_id            = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PHLAT-SERVICE.keycloak_openid_client.CLIENT will be updated in-place
  ~ resource "keycloak_openid_client" "CLIENT" {
      ~ description                                = "PLR Health Service Delivery Site Data Load Assistant Tool - Service Account Used for PLR communication" -> "PLR Health Service Delivery Site Data Load Assistant Tool - Service Account Used for PLR CONF communication"
        id                                         = "ec679617-6a08-4168-9efd-e60474e503b5"
        name                                       = "PHLAT-SERVICE"
        # (24 unchanged attributes hidden)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PHLAT-SERVICE.keycloak_openid_hardcoded_claim_protocol_mapper.orgId will be created
  + resource "keycloak_openid_hardcoded_claim_protocol_mapper" "orgId" {
      + add_to_access_token = true
      + add_to_id_token     = true
      + add_to_userinfo     = true
      + claim_name          = "orgId"
      + claim_value         = "00002855"
      + claim_value_type    = "String"
      + client_id           = "ec679617-6a08-4168-9efd-e60474e503b5"
      + id                  = (known after apply)
      + name                = "orgId"
      + realm_id            = "moh_applications"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PHLAT-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR/REG_ADMIN"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "30f494e9-41c7-40eb-9660-a14bb8248af4"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PHLAT-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_realm_role.ROLE["default-roles-moh_applications"] will be created
  + resource "keycloak_openid_client_service_account_realm_role" "ROLE" {
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "default-roles-moh_applications"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PHLAT-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR/REG_ADMIN"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "dc7b9502-3ffa-4ff8-be2e-ebfebe650590"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "REG_ADMIN"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PHLAT-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_CONF/REG_ADMIN"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = "ec679617-6a08-4168-9efd-e60474e503b5"
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "92a2dc0e-0595-4d15-b5a3-87e56140e441"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PHLAT-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_realm_role.ROLE["default-roles-moh_applications"] will be created
  + resource "keycloak_openid_client_service_account_realm_role" "ROLE" {
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "default-roles-moh_applications"
      + service_account_user_id = "0880a44a-6543-4149-81ef-f21cce63169b"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PHLAT-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_CONF/REG_ADMIN"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "c0fe2e9f-6937-4ffa-9296-d786d9b0a98b"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "REG_ADMIN"
      + service_account_user_id = "0880a44a-6543-4149-81ef-f21cce63169b"
    }

Plan: 9 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*